uhnp/src/Catalogs/РегистрыБухгалтерииБД/РегистрыБухгалтерииБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РегистрыБухгалтерииБД</name>
  <comment>Содержит данные, необходимые для параметрической настройки выборки данных из регистров бухгалтерии текущей и внешних информационных баз</comment>
  <owners>Catalog.ТипыБазДанных</owners>
  <attributes>
    <name>Корреспонденция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетов</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Регистраторы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Синоним1</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Синоним2</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетовМетаданные</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаУточненияПериода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Измерения</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Балансовый</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакУчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НеЯвляетсяРазделителемДанных</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним1</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним2</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ресурсы</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Балансовый</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакУчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакУчетаСубконто</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним1</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним2</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Реквизиты</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Enums/ПлатформыВнешнихИнформационныхБаз/ПлатформыВнешнихИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПлатформыВнешнихИнформационныхБаз</name>
  <enumValues>
    <name>Предприятие8</name>
  </enumValues>
  <enumValues>
    <name>Предприятие81</name>
  </enumValues>
  <enumValues>
    <name>Предприятие77</name>
  </enumValues>
  <enumValues>
    <name>Предприятие82</name>
  </enumValues>
  <enumValues>
    <name>Предприятие83</name>
  </enumValues>
  <enumValues>
    <name>ADO</name>
    <comment>Работа с внешними информационными базами через ADO</comment>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ТипыБазДанных/ТипыБазДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыБазДанных</name>
  <predefined>
    <items>
      <name>ТекущаяИБ</name>
      <description>Текущая информационная база</description>
    </items>
    <items>
      <name>ОбменТаблДок</name>
      <description>Файлы Microsoft Excel</description>
    </items>
  </predefined>
  <attributes>
    <name>ВИБПоУмолчанию</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>EnumRef.ПлатформыВнешнихИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПоУмолчанию</name>
    <comment>Если при сопоставлении получено пустое значение валюты, тогда подставить значение валюты по умолчанию</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменДаннымиРегламентнымЗаданием</name>
    <comment>Выполнять данными контроля НСИ регламентным заданием</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьНСИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуютсяПланыОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеВидовСубконто</name>
    <attributes>
      <name>ВидСубконтоИБ</name>
      <type>
        <types>ChartOfCharacteristicTypesRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидАналитики</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/ПланыСчетовБД/ПланыСчетовБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПланыСчетовБД</name>
  <comment>Содержит реквизиты планов счетов текущей и внешних информационных баз, необходимые для настройки выборки</comment>
  <owners>Catalog.ТипыБазДанных</owners>
  <attributes>
    <name>МаксимальноеКоличествоСубконто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакиУчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакиУчетаСубконто</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксДт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксКт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчетаОСВ</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетТР</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаКода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидыСубконто</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидыСубконтоОписание</name>
    <type>
      <types>CatalogRef.ПланыВидовХарактеристикБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетовМетаданные</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетовИсточник</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСиноним</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МетаданныеТекущейИБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетовМСФО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьРегистрБухгалтерии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаскаКода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Синоним1</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Синоним2</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СчетаИтогов</name>
    <attributes>
      <name>СчетИтога</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Реквизиты</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеПримитивногоТипа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийРеквизит</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним1</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним2</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/РегистрыБухгалтерииБД/ObjectModule.bsl
Перем Используется77; // Признак использования обращения к ВИБ на платформе 7.7
Перем ТекСоединениеВИБ Экспорт; // Текущее соединение с внешней информационной базой
Перем РегистрБД;
Перем ТекущаяИБ;
Перем мОписаниеТиповСтрока;
Перем мОписаниеТиповБулево;
Перем мОписаниеТиповТЗ;
Перем мОписаниеТиповСписокЗначений;

Процедура ЗаполнитьРеквизитыОбъекта(Кэш = Неопределено, ЕстьИзменения = Истина) Экспорт
	
	Если Не ПроверитьНаименование() Тогда		
		Возврат;		
	КонецЕсли;
	
	ТекущаяИБ = (Владелец = Справочники.ТипыБазДанных.ТекущаяИБ);
	ПолеСиноним=РаботаСОбъектамиМетаданныхУХ.ПолучитьПолеСиноним();
	
	Если НЕ ТекущаяИБ Тогда
		
		Если ТекСоединениеВИБ = Неопределено Тогда
			
			ТекСоединениеВИБ = ОбщегоНазначенияУХ.ПолучитьСоединениеСВИБПоУмолчанию(Владелец, 1);
			
			Если ТекСоединениеВИБ = Неопределено Тогда
				
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ТекСоединениеВИБ = РаботаСОбъектамиМетаданныхУХ.КонтекстМетаданных();
		
	КонецЕсли;
	
	СтруктураОписания = РаботаСОбъектамиМетаданныхУХ.ПолучитьСтруктуруОписанияРегистраБухгалтерииБД(
		Наименование, ТекСоединениеВИБ, Использование77(), Кэш);
	Если НЕ ЗначениеЗаполнено(СтруктураОписания.Регистраторы) Тогда
		СтруктураОписания.Регистраторы = "";
	КонецЕсли;	
	
	Если СтруктураОписания.Свойство("ТекстОшибки") Тогда		
		ОбщегоНазначенияУХ.СообщитьОбОшибке(СтруктураОписания.ТекстОшибки, Истина,, СтатусСообщения.Внимание);
		Возврат;		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСерверУХ.УстановитьНовоеЗначение(ЭтотОбъект[ПолеСиноним], СтруктураОписания.Синоним, ЕстьИзменения);
	
	РаботаСОбъектамиМетаданныхУХ.ЗаполнитьИзмененныеРеквизиты(ЭтотОбъект, СтруктураОписания, "Реквизиты,Измерения,Ресурсы,Синоним", ЕстьИзменения);
	
	ТабНовыеРесурсы=РаботаСОбъектамиМетаданныхУХ.ПолучитьНовыеДанныеТабличнойЧасти(ПолеСиноним, Ресурсы,СтруктураОписания.Ресурсы);
	РаботаСОбъектамиМетаданныхУХ.ЗагрузитьИзмененнуюТабЧасть(Ресурсы, ТабНовыеРесурсы, ЕстьИзменения);
	
	ТабНовыеИзмерения=РаботаСОбъектамиМетаданныхУХ.ПолучитьНовыеДанныеТабличнойЧасти(ПолеСиноним, Измерения,СтруктураОписания.Измерения);	
	РаботаСОбъектамиМетаданныхУХ.ЗагрузитьИзмененнуюТабЧасть(Измерения, ТабНовыеИзмерения, ЕстьИзменения); 
	
	ТабНовыеРеквизиты=РаботаСОбъектамиМетаданныхУХ.ПолучитьНовыеДанныеТабличнойЧасти(ПолеСиноним, Реквизиты,СтруктураОписания.Реквизиты);	
	РаботаСОбъектамиМетаданныхУХ.ЗагрузитьИзмененнуюТабЧасть(Реквизиты, ТабНовыеРеквизиты, ЕстьИзменения);

	ОбщегоНазначенияКлиентСерверУХ.УстановитьНовоеЗначение(ЭтотОбъект.ПланСчетов, ПолучитьПланСчетовБД(), ЕстьИзменения);
		
КонецПроцедуры // ЗаполнитьРеквизитыОбъекта()

Функция ПолучитьПланСчетовБД()

	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПланыСчетовБД.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПланыСчетовБД КАК ПланыСчетовБД
	|ГДЕ
	|	НЕ ПланыСчетовБД.ПометкаУдаления
	|	И НЕ ПланыСчетовБД.ОтсутствуетВКонфигурации
	|	И ПланыСчетовБД.ПланСчетовМетаданные = &ПланСчетовМетаданные
	|	И ПланыСчетовБД.Наименование = &ПланСчетовМетаданные
	|	И ПланыСчетовБД.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("ПланСчетовМетаданные",ПланСчетовМетаданные);
	Запрос.УстановитьПараметр("Владелец",Владелец);
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		
		Возврат Результат.Ссылка;
		
	Иначе
		
		Возврат Справочники.ПланыСчетовБД.ПустаяСсылка();
		
	КонецЕсли;	
	
КонецФункции // ПолучитьПланСчетовБД() 


	
Функция ПроверитьНаименование()
	
	ЕстьОшибки=Ложь;
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		
		ОбщегоНазначенияУХ.СообщитьОбОшибке(Нстр("ru = 'Для обрабатываемого плана счетов внешней информационной базы не указано наименование.'"),ЕстьОшибки,,СтатусСообщения.Внимание);
		
	КонецЕсли;
	
	Возврат НЕ ЕстьОшибки;
			
КонецФункции // ПроверитьНаименование()

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	Иначе	
		Отказ = НЕ ПроверитьНаименование();
	КонецЕсли;
		
КонецПроцедуры

Функция Использование77() Экспорт
		
	Если Используется77 = Неопределено Тогда
		Используется77 = (Владелец.ВерсияПлатформы = Перечисления.ПлатформыВнешнихИнформационныхБаз.Предприятие77);	
	КонецЕсли;
	
	Возврат Используется77;
	
КонецФункции
